# Pandas and String Methods Exercise 1

In [26]:
products = {
    'row': [1,2,3],
    'brand': ['samsung','apple','sony'],
    'model': ['S20','iPhone 12','PlayStation 4'],
}

prices = {
    'price': ['3000 AED', '4000 AED', '2500 AED']
}

In [27]:
# 1 - Create a DataFrame from the dict 'products'
# 2 - Remove 'rows' from the DataFrame
# 3 - Append 'prices' to DataFrame
# 4 - Cast 'prices' as integer (use .astype())
# 5 - Capitalize names of brands (see string methods and .apply(lambda ..., axis=1))
# 6 - Get highest priced product (hint: use .max())
# 7 - Add 'currency' column
# 8 - Convert AED to USD (1 AED = 0.2724 USD)

# Final Example of DataFrame
"""
brand   |   model   |   prices   |   currency
---------------------------------------------
Samsung |   S20     |   3000     |   817.2

"""

'\nbrand   |   model   |   prices   |   currency\n---------------------------------------------\nSamsung |   S20     |   3000     |   817.2\n\n'

In [28]:
# Import libraries
import pandas as pd

In [29]:
# 1
products_df = pd.DataFrame(data=products)

In [30]:
products_df.head()

   row    brand          model
0    1  samsung            S20
1    2    apple      iPhone 12
2    3     sony  PlayStation 4

In [31]:
# 2
products_df.drop('row', axis=1, inplace=True)
products_df.head()

     brand          model
0  samsung            S20
1    apple      iPhone 12
2     sony  PlayStation 4

In [32]:
# 3
products_df['prices'] = pd.DataFrame(data=prices)
products_df.head()

     brand          model    prices
0  samsung            S20  3000 AED
1    apple      iPhone 12  4000 AED
2     sony  PlayStation 4  2500 AED

In [33]:
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   brand   3 non-null      object
 1   model   3 non-null      object
 2   prices  3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [34]:
# 4
products_df['prices'] = products_df['prices'].str.replace('AED', '')
products_df['prices'] = products_df['prices'].astype(int)
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   brand   3 non-null      object
 1   model   3 non-null      object
 2   prices  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [35]:
# 5
products_df['brand'] = products_df['brand'].apply(lambda arg: arg.capitalize())
products_df.head()

     brand          model  prices
0  Samsung            S20    3000
1    Apple      iPhone 12    4000
2     Sony  PlayStation 4    2500

In [36]:
# 6.a
cond = products_df['prices'].max()
products_df[ products_df['prices'] == cond ]

   brand      model  prices
1  Apple  iPhone 12    4000

In [37]:
# 6.b
products_df.sort_values(by='prices', ascending=False)

     brand          model  prices
1    Apple      iPhone 12    4000
0  Samsung            S20    3000
2     Sony  PlayStation 4    2500

In [38]:
# 7 & 8
prices_usd_df = products_df['prices'].map(lambda arg: arg * 0.2724)
products_df['currency'] = prices_usd_df

In [39]:
products_df.head()

     brand          model  prices  currency
0  Samsung            S20    3000     817.2
1    Apple      iPhone 12    4000    1089.6
2     Sony  PlayStation 4    2500     681.0